espressif/arduino-esp32/cores/esp32/esp32-hal-spi.c
bool spiAttachMISO(spi_t *spi, int8_t miso) {
  if (!spi || miso < 0) {
    return false;
  }
  void *bus = perimanGetPinBus(miso, ESP32_BUS_TYPE_SPI_MASTER_MISO);
  if (bus != NULL && !perimanClearPinBus(miso)) {
    return false;
  }
  pinMode(miso, INPUT);
  pinMatrixInAttach(miso, SPI_MISO_IDX(spi->num), false);
  spi->miso = miso;
  if (!perimanSetPinBus(miso, ESP32_BUS_TYPE_SPI_MASTER_MISO, (void *)(spi->num + 1), spi->num, -1)) {
    spiDetachBus_MISO((void *)(spi->num + 1));
    log_e("Failed to set pin bus to SPI for pin %d", miso);
    return false;
  }
  return true;
}

bool spiAttachMOSI(spi_t *spi, int8_t mosi) {
  if (!spi || mosi < 0) {
    return false;
  }
  void *bus = perimanGetPinBus(mosi, ESP32_BUS_TYPE_SPI_MASTER_MOSI);
  if (bus != NULL && !perimanClearPinBus(mosi)) {
    return false;
  }
  pinMode(mosi, OUTPUT);
  pinMatrixOutAttach(mosi, SPI_MOSI_IDX(spi->num), false, false);
  spi->mosi = mosi;
  if (!perimanSetPinBus(mosi, ESP32_BUS_TYPE_SPI_MASTER_MOSI, (void *)(spi->num + 1), spi->num, -1)) {
    spiDetachBus_MOSI((void *)(spi->num + 1));
    log_e("Failed to set pin bus to SPI for pin %d", mosi);
    return false;
  }
  return true;
}

bool spiDetachSCK(spi_t *spi) {
  if (!spi) {
    return false;
  }
  int8_t sck = spi->sck;
  if (sck != -1) {
    pinMatrixOutDetach(sck, false, false);
    spi->sck = -1;
    perimanClearPinBus(sck);
  }
  return true;
}

bool spiDetachMISO(spi_t *spi) {
  if (!spi) {
    return false;
  }
  int8_t miso = spi->miso;
  if (miso != -1) {
    pinMatrixInDetach(SPI_MISO_IDX(spi->num), false, false);
    spi->miso = -1;
    perimanClearPinBus(miso);
  }
  return true;
}

bool spiDetachMOSI(spi_t *spi) {
  if (!spi) {
    return false;
  }
  int8_t mosi = spi->mosi;
  if (mosi != -1) {
    pinMatrixOutDetach(mosi, false, false);
    spi->mosi = -1;
    perimanClearPinBus(mosi);
  }
  return true;
}

bool spiAttachSS(spi_t *spi, uint8_t ss_num, int8_t ss) {
  if (!spi || ss < 0 || ss_num > 2) {
    return false;
  }
  void *bus = perimanGetPinBus(ss, ESP32_BUS_TYPE_SPI_MASTER_SS);
  if (bus != NULL && !perimanClearPinBus(ss)) {
    return false;
  }
  pinMode(ss, OUTPUT);
  pinMatrixOutAttach(ss, SPI_SS_IDX(spi->num, ss_num), spi->ss_invert, false);
  spiEnableSSPins(spi, (1 << ss_num));
  spi->ss = ss;
  if (!perimanSetPinBus(ss, ESP32_BUS_TYPE_SPI_MASTER_SS, (void *)(spi->num + 1), spi->num, -1)) {
    spiDetachBus_SS((void *)(spi->num + 1));
    log_e("Failed to set pin bus to SPI for pin %d", ss);
    return false;
  }
  return true;
}

bool spiDetachSS(spi_t *spi) {
  if (!spi) {
    return false;
  }
  int8_t ss = spi->ss;
  if (ss != -1) {
    pinMatrixOutDetach(ss, false, false);
    spi->ss = -1;
    perimanClearPinBus(ss);
  }
  return true;
}

void spiEnableSSPins(spi_t *spi, uint8_t ss_mask) {
  if (!spi) {
    return;
  }
  SPI_MUTEX_LOCK();
#if CONFIG_IDF_TARGET_ESP32
  spi->dev->pin.val &= ~(ss_mask & SPI_SS_MASK_ALL);
#else
  spi->dev->misc.val &= ~(ss_mask & SPI_SS_MASK_ALL);
#endif
  SPI_MUTEX_UNLOCK();
}

void spiDisableSSPins(spi_t *spi, uint8_t ss_mask) {
  if (!spi) {
    return;
  }
  SPI_MUTEX_LOCK();
#if CONFIG_IDF_TARGET_ESP32
  spi->dev->pin.val |= (ss_mask & SPI_SS_MASK_ALL);
#else
  spi->dev->misc.val |= (ss_mask & SPI_SS_MASK_ALL);
#endif
  SPI_MUTEX_UNLOCK();
}

void spiSSEnable(spi_t *spi) {
  if (!spi) {
    return;
  }
  SPI_MUTEX_LOCK();
  spi->dev->user.cs_setup = 1;
  spi->dev->user.cs_hold = 1;
  SPI_MUTEX_UNLOCK();
}

void spiSSDisable(spi_t *spi) {
  if (!spi) {
    return;
  }
  SPI_MUTEX_LOCK();
  spi->dev->user.cs_setup = 0;
  spi->dev->user.cs_hold = 0;
  SPI_MUTEX_UNLOCK();
}

void spiSSInvert(spi_t *spi, bool invert) {
  if (spi) {
    spi->ss_invert = invert;
  }
}

void spiSSSet(spi_t *spi) {
  if (!spi) {
    return;
  }
  SPI_MUTEX_LOCK();
#if CONFIG_IDF_TARGET_ESP32
  spi->dev->pin.cs_keep_active = 1;
#else
  spi->dev->misc.cs_keep_active = 1;
#endif
  SPI_MUTEX_UNLOCK();
}

void spiSSClear(spi_t *spi) {
  if (!spi) {
    return;
  }
  SPI_MUTEX_LOCK();
#if CONFIG_IDF_TARGET_ESP32
  spi->dev->pin.cs_keep_active = 0;
#else
  spi->dev->misc.cs_keep_active = 0;
#endif
  SPI_MUTEX_UNLOCK();
}

uint32_t spiGetClockDiv(spi_t *spi) {
  if (!spi) {
    return 0;
  }
  return spi->dev->clock.val;
}

#if defined(CONFIG_IDF_TARGET_ESP32P4)
/**
 * @brief Calculate SPI frequency from divider value and source frequency
 *
 * @param divider The clock divider value (must be > 0)
 * @param source_freq The source clock frequency in Hz (e.g., 40MHz for XTAL, 480MHz for SPLL)
 * @return uint32_t The calculated SPI clock frequency in Hz, or 0 if divider is 0
 *
 * @note ESP32P4-specific helper function. Calculates: frequency = source_freq / divider
 */
static inline uint32_t _dividerToFreq(uint32_t divider, uint32_t source_freq) {
  if (divider == 0) {
    return 0;  // Safety check
  }
  return source_freq / divider;
}

/**
 * @brief Extract the divider value from a clockDiv register value
 *
 * @param clockDiv The SPI clock divider register value
 * @return uint32_t The calculated divider: (clkdiv_pre + 1) * (clkcnt_n + 1)
 *
 * @note ESP32P4-specific helper function. Extracts clkcnt_n (bits 12-17) and
 *       clkdiv_pre (bits 18-21) from the register value using bit shifts.
 *       For SPI_CLK_EQU_SYSCLK (0x80000000), this naturally returns 1 (no division).
 */
static inline uint32_t _clockDivToDivider(uint32_t clockDiv) {
  uint32_t clkcnt_n = (clockDiv >> 12) & 0x3F;
  uint32_t clkdiv_pre = (clockDiv >> 18) & 0xF;
  return ((clkdiv_pre + 1) * (clkcnt_n + 1));
}
#endif

/**
 * @brief Internal function to set SPI clock divider and handle ESP32P4 clock source switching
 *
 * @param spi Pointer to SPI bus structure
 * @param clockDiv The clock divider register value to set
 *
 * @note This function does NOT acquire the SPI mutex - it must be called from within
 *       a context that already holds the mutex.
 *
 * @note Callers (all properly acquire mutex before calling):
 *       - spiSetClockDiv() - acquires mutex via SPI_MUTEX_LOCK() before calling
 *       - spiTransaction() - acquires mutex via SPI_MUTEX_LOCK() before calling
 *       - _on_apb_change() - acquires mutex via SPI_MUTEX_LOCK() before calling (APB_AFTER_CHANGE case)
 *
 * @note ESP32P4-specific behavior:
 *       - Determines the appropriate clock source (XTAL or SPLL) based on the divider value
 *       - Uses stored per-instance clock source information if available (from last calculation)
 *       - Otherwise infers clock source by checking which gives a valid frequency:
 *         * XTAL is capped at 40MHz, so if calculated frequency > 40MHz, must use SPLL
 *         * For <= 40MHz frequencies, prefers XTAL if valid
 *       - Switches clock source if needed (with proper clock gating and delay)
 *       - Updates per-instance tracking variables (last_clock_div, last_clk_src)
 */
static void _spiSetClockDivInternal(spi_t *spi, uint32_t clockDiv) {
  if (!spi) {
    return;
  }
#if defined(CONFIG_IDF_TARGET_ESP32P4)
  // ESP32P4: Determine clock source from divider
  // The divider was calculated by spiFrequencyToClockDiv() which picks the best match
  // We store which source was selected per SPI instance, so use that if available.
  // Otherwise, infer from the divider by checking which gives a "more reasonable" frequency.
  uint32_t xtal_freq = getXtalFrequencyMhz() * 1000000;  // Actual XTAL frequency (typically 40 MHz)
  uint32_t spll_freq = SPI_P4_SPLL_FREQ_HZ;

  uint8_t new_clk_src;
  if (clockDiv == spi->last_clock_div && spi->last_clock_div != 0) {
    new_clk_src = spi->last_clk_src;
  } else {
    uint32_t divider = _clockDivToDivider(clockDiv);
    uint32_t freq_with_xtal = _dividerToFreq(divider, xtal_freq);
    uint32_t freq_with_spll = _dividerToFreq(divider, spll_freq);

    // Infer: Prefer XTAL whenever it yields a valid <= 40MHz SPI clock,
    // and fall back to SPLL only when XTAL cannot produce a valid frequency.
    if (freq_with_xtal > 0 && freq_with_xtal <= xtal_freq) {
      new_clk_src = 0;  // XTAL
    } else if (freq_with_spll > 0) {
      new_clk_src = 1;  // SPLL
    } else {
      // Both inferred frequencies are invalid; keep current source to avoid unnecessary switching.
      new_clk_src = spi->clk_src;
    }
  }

  // Store the divider and source for this SPI instance
  spi->last_clock_div = clockDiv;
  spi->last_clk_src = new_clk_src;

