espressif/arduino-esp32/cores/esp32/esp32-hal-spi.c
    data += c_longs;
    longs -= c_longs;
    len -= c_len;
  }
}

/*
 * Clock Calculators
 *
 * */

typedef union {
  uint32_t value;
  struct {
    uint32_t clkcnt_l : 6; /*it must be equal to spi_clkcnt_N.*/
    uint32_t clkcnt_h : 6; /*it must be floor((spi_clkcnt_N+1)/2-1).*/
    uint32_t clkcnt_n : 6; /*it is the divider of spi_clk. So spi_clk frequency is system/(spi_clkdiv_pre+1)/(spi_clkcnt_N+1)*/
#if !defined(CONFIG_IDF_TARGET_ESP32) && !defined(CONFIG_IDF_TARGET_ESP32S2)
    uint32_t clkdiv_pre : 4; /*it is pre-divider of spi_clk.*/
    uint32_t reserved   : 9; /*reserved*/
#else
    uint32_t clkdiv_pre : 13; /*it is pre-divider of spi_clk.*/
#endif
    uint32_t clk_equ_sysclk : 1; /*1: spi_clk is equal to system 0: spi_clk is divided from system clock.*/
  };
} spiClk_t;

#define ClkRegToFreq(reg) (src_freq / (((reg)->clkdiv_pre + 1) * ((reg)->clkcnt_n + 1)))

uint32_t spiClockDivToFrequency(spi_t *spi, uint32_t clockDiv) {
#if defined(CONFIG_IDF_TARGET_ESP32P4)
  // ESP32P4: Use the actual clock source being used by this SPI instance
  uint32_t src_freq;
  if (spi && spi->clk_src == 1) {
    // SPLL is being used
    src_freq = SPI_P4_SPLL_FREQ_HZ;
  } else {
    // XTAL is being used (default or if spi is NULL)
    src_freq = getXtalFrequencyMhz() * 1000000;
  }
#else
  // For non-ESP32P4 targets, ignore spi parameter; the whole bus shares one source.
  (void)spi;
  uint32_t src_freq = spiSourceFrequency();
#endif
  spiClk_t reg = {clockDiv};
  return ClkRegToFreq(&reg);
}

/**
 * @brief Calculate SPI clock divider register value for a given frequency and clock source
 *
 * @param freq Desired SPI clock frequency in Hz
 * @param source_freq Source clock frequency in Hz (e.g., 40MHz for XTAL, 480MHz for SPLL)
 * @return uint32_t Clock divider register value, or SPI_CLK_EQU_SYSCLK if freq >= source_freq
 *
 * @note This function calculates the optimal divider values (clkdiv_pre and clkcnt_n) to achieve
 *       the desired frequency from the given source. It searches for the best match that produces
 *       a frequency <= the desired frequency (never exceeding it).
 *
 * @note If the desired frequency is >= source_freq, returns SPI_CLK_EQU_SYSCLK (0x80000000)
 *       which indicates the clock should equal the source without division.
 *
 * @note If the desired frequency is below the minimum achievable, returns the minimum divider
 *       register value (0x7FFFF000).
 *
 * @note Used by spiFrequencyToClockDiv() to calculate dividers for both XTAL and SPLL sources
 *       on ESP32P4, allowing selection of the source that gives the closest match.
 */
static uint32_t _spiFrequencyToClockDivWithSource(uint32_t freq, uint32_t source_freq) {
  if (freq >= source_freq) {
    return SPI_CLK_EQU_SYSCLK;
  }

  const spiClk_t minFreqReg = {0x7FFFF000};
  // Calculate minFreq using the provided source frequency
  uint32_t minFreq = source_freq / (((minFreqReg.clkdiv_pre + 1) * (minFreqReg.clkcnt_n + 1)));
  if (freq < minFreq) {
    return minFreqReg.value;
  }

  uint8_t calN = 1;
  spiClk_t bestReg = {0};
  uint32_t bestFreq = 0;

  while (calN <= 0x3F) {
    spiClk_t reg = {0};
    uint32_t calFreq;
    int32_t calPre;
    int8_t calPreVari = -2;

    reg.clkcnt_n = calN;

    while (calPreVari++ <= 1) {
      calPre = (((source_freq / (reg.clkcnt_n + 1)) / freq) - 1) + calPreVari;
#if !defined(CONFIG_IDF_TARGET_ESP32) && !defined(CONFIG_IDF_TARGET_ESP32S2)
      if (calPre > 0xF) {
        reg.clkdiv_pre = 0xF;
#else
      if (calPre > 0x1FFF) {
        reg.clkdiv_pre = 0x1FFF;
#endif
      } else if (calPre <= 0) {
        reg.clkdiv_pre = 0;
      } else {
        reg.clkdiv_pre = calPre;
      }
      reg.clkcnt_l = ((reg.clkcnt_n + 1) / 2);
      // Calculate frequency directly using source_freq instead of ClkRegToFreq macro
      calFreq = source_freq / (((reg.clkdiv_pre + 1) * (reg.clkcnt_n + 1)));
      if (calFreq == freq) {
        memcpy(&bestReg, &reg, sizeof(bestReg));
        break;
      } else if (calFreq < freq) {
        if (bestFreq == 0 || (freq - calFreq) < (freq - bestFreq)) {
          bestFreq = calFreq;
          memcpy(&bestReg, &reg, sizeof(bestReg));
        }
      }
    }
    if (calFreq == (int32_t)freq) {
      break;
    }
    calN++;
  }
  return bestReg.value;
}

uint32_t spiFrequencyToClockDiv(spi_t *spi, uint32_t freq) {
#if defined(CONFIG_IDF_TARGET_ESP32P4)
  // ESP32P4: Limit frequency to SPI peripheral maximum
  if (freq > SPI_P4_MAX_FREQ_HZ) {
    freq = SPI_P4_MAX_FREQ_HZ;
  }

  // Try both clock sources and pick the one that gives frequency closest to desired
  uint32_t xtal_freq = getXtalFrequencyMhz() * 1000000;  // Actual XTAL frequency (typically 40 MHz)
  uint32_t spll_freq = SPI_P4_SPLL_FREQ_HZ;

  // Calculate dividers for both sources
  uint32_t div_xtal = _spiFrequencyToClockDivWithSource(freq, xtal_freq);
  uint32_t div_spll = _spiFrequencyToClockDivWithSource(freq, spll_freq);

  // Calculate actual frequencies each divider would produce
  uint32_t divider_xtal = _clockDivToDivider(div_xtal);
  uint32_t divider_spll = _clockDivToDivider(div_spll);
  uint32_t freq_xtal = _dividerToFreq(divider_xtal, xtal_freq);
  uint32_t freq_spll = _dividerToFreq(divider_spll, spll_freq);

  // Pick the one closest to desired frequency
  uint32_t diff_xtal = (freq > freq_xtal) ? (freq - freq_xtal) : (freq_xtal - freq);
  uint32_t diff_spll = (freq > freq_spll) ? (freq - freq_spll) : (freq_spll - freq);

  // Pick the one with closest difference to desired frequency
  // If both are valid (XTAL capped at its actual frequency) and differences are equal, prefer XTAL
  uint8_t best_is_spll;
  if (diff_spll < diff_xtal) {
    best_is_spll = 1;  // SPLL is closer
  } else if (diff_xtal < diff_spll) {
    best_is_spll = 0;  // XTAL is closer
  } else {
    // Equal differences: prefer XTAL if it's valid (freq_xtal <= xtal_freq), otherwise use SPLL
    best_is_spll = (freq_xtal <= xtal_freq) ? 0 : 1;
  }
  uint32_t best_div = best_is_spll ? div_spll : div_xtal;

  // Store the divider and source for this SPI instance (if spi is provided)
  if (spi) {
    spi->last_clock_div = best_div;
    spi->last_clk_src = best_is_spll;
  }

  // Return divider for the clock source that gives closest match
  return best_div;
#else
  // Non-ESP32P4: the peripheral stays on the source picked at bus init, spi parameter unused.
  (void)spi;  // Suppress unused parameter warning
  return _spiFrequencyToClockDivWithSource(freq, spiSourceFrequency());
#endif
}

#endif /* SOC_GPSPI_SUPPORTED */
